namespace GTASA{
enum eModelID : uint16 {MODEL_PREDATOR = 430};
enum eDoors : uint32 {BONNET, BOOT, FRONT_LEFT_DOOR, FRONT_RIGHT_DOOR, REAR_LEFT_DOOR, REAR_RIGHT_DOOR, MAX_DOORS};
eDoors operator++(eDoors& i, int){i = (eDoors)((uint32)i + 1); return i;}
struct CVehicle{
	private: byte gap0[0x3A];
	public: eModelID m_nModelIndex;
}; VALIDATE_OFFSET(CVehicle, m_nModelIndex, 0x3A);
namespace CAchievement{
	bool *messagedAboutCheating;
	inline void _Init(){
		SET_TO(messagedAboutCheating, SYM("_ZN12CAchievement21messagedAboutCheatingE"));
	}
}
namespace CAutomobile{
	void (*CloseAllDoors)(CVehicle* self);
	bool (*IsDoorFullyOpen)(const CVehicle *self, eDoors DoorID);
	bool (*IsDoorMissing)(const CVehicle *self, eDoors DoorID);
	void (*OpenDoor)(CVehicle *self, void *pPed, int index, eDoors DoorID, float timeRatio, bool bPlaySoundSample);
	void _Init(){
		SET_TO(CloseAllDoors, SYM("_ZN11CAutomobile13CloseAllDoorsEv"));
		SET_TO(IsDoorFullyOpen, SYM("_ZNK11CAutomobile15IsDoorFullyOpenE6eDoors"));
		SET_TO(IsDoorMissing, SYM("_ZNK11CAutomobile13IsDoorMissingE6eDoors"));
		SET_TO(OpenDoor, SYM("_ZN11CAutomobile8OpenDoorEP4CPedi6eDoorsfb"));
	}
}
namespace CCheat{
	bool (*m_aCheatsActive)[105];
	bool *m_bHasPlayerCheated;
	char16_t* *m_CheatString;
	uint32 *m_nCheatStringSize; //这个实际上是前一个FString的长度成员
	void (*ScriptBypassCheat)();
	void (*TimeTravelCheat)();
	//void (*TogglePlayerInvincibility)();
	CVehicle* (*VehicleCheat)(int modelId, bool bSpawnAsPlayerRemoteControl, float);
	void (*WeaponCheat4)();

	void _Init(){
		SET_TO(m_aCheatsActive, SYM("_ZN6CCheat15m_aCheatsActiveE"));
		SET_TO(m_bHasPlayerCheated, SYM("_ZN6CCheat19m_bHasPlayerCheatedE"));
		SET_TO(m_CheatString, SYM("_ZN6CCheat13m_CheatStringE"));
		SET_TO(m_nCheatStringSize, uintptr_t(m_CheatString) + sizeof(m_CheatString));
		SET_TO(ScriptBypassCheat, SYM("_ZN6CCheat17ScriptBypassCheatEv"));
		SET_TO(TimeTravelCheat, SYM("_ZN6CCheat15TimeTravelCheatEv"));
		SET_TO(VehicleCheat, SYM("_ZN6CCheat12VehicleCheatEibf"));
		//SET_TO(TogglePlayerInvincibility, SYM("_ZN6CCheat25TogglePlayerInvincibilityEv"));
		SET_TO(WeaponCheat4, SYM("_ZN6CCheat12WeaponCheat4Ev"));
	}

	bool _TestCheat(const char* text, int size){
		if(*CCheat::m_nCheatStringSize < size+1) return false;
		char* pos1 = (char*)(*CCheat::m_CheatString + (*m_nCheatStringSize-size-1));
		const char* pos2 = text;
		while(true){
			if(*pos1 && (tolower(*pos1++) != tolower(*pos2++)))
				return false;
			pos1++;
			if(!*((char16_t*)pos1)){ //其实是个很蠢的对比方案，这也是宽字符恶心的地方
				*CCheat::m_nCheatStringSize = 0;
				(*CCheat::m_CheatString)[0] = 0;
				return true;
			}
		}
	}
}
enum eModelID : uint16;
enum AssocGroupId : uint32;
struct _CPed{
	private: byte gap0[0x3A];
	public: eModelID m_nModelIndex;
	private: byte gap3C[0x6A4];
	public: AssocGroupId m_nAnimGroup;
}; VALIDATE_OFFSET(_CPed, m_nAnimGroup, 0x6E0);
namespace CClothes{
	void (*RebuildPlayer)(_CPed* player, bool bIgnoreFatAndMuscle);
	inline void _Init(){
		SET_TO(RebuildPlayer, SYM("_ZN8CClothes13RebuildPlayerEP10CPlayerPedb"));
	}
}
namespace CDamageManager{
	int (*GetCarNodeIndexFromDoor)(eDoors DoorIndex);
	inline void _Init(){
		SET_TO(GetCarNodeIndexFromDoor, SYM("_ZN14CDamageManager23GetCarNodeIndexFromDoorE6eDoors"));
	}
}
struct CEntryExit {
	char    m_szName[8];
	CRect   m_recEntrance;
	float   m_fEntranceZ;
	float   m_fEntranceAngleRad;
	CVector m_vecExitPos;
	float   m_fExitAngle;
	union {
		struct {
			uint16 bUnknownInterior : 1;     // 0x1
			uint16 bUnknownPairing : 1;      // 0x2
			uint16 bCreateLinkedPair : 1;    // 0x4
			uint16 bRewardInterior : 1;      // 0x8
			uint16 bUsedRewardEntrance : 1;  // 0x10
			uint16 bCarsAndAircraft : 1;     // 0x20
			uint16 bBikesAndMotorcycles : 1; // 0x40
			uint16 bDisableOnFoot : 1;       // 0x80

			uint16 bAcceptNpcGroup : 1;      // 0x100
			uint16 bFoodDateFlag : 1;        // 0x200
			uint16 bUnknownBurglary : 1;     // 0x400
			uint16 bDisableExit : 1;         // 0x800
			uint16 bBurglaryAccess : 1;      // 0x1000
			uint16 bEnteredWithoutExit : 1;  // 0x2000
			uint16 bEnableAccess : 1;        // 0x4000
			uint16 bDeleteEnex : 1;          // 0x8000
		};
		uint16 m_nFlags;
	};
	uint8       m_nArea;
	uint8       m_nSkyColor;
	uint8       m_nTimeOn;
	uint8       m_nTimeOff;
	uint8       m_nNumberOfPeds;
	CEntryExit* m_pLink;
}; VALIDATE_SIZE(CEntryExit, 64);
template <class A, class B = A> struct CPool {
	B*     m_pObjects;
	uint8* m_byteMap;
	int32  m_nSize;
	int32  m_nFirstFree;
	bool   m_bOwnsAllocations;
	bool   m_bIsLocked; // Seemingly not used anywhere, only toggled on/off
};
typedef CPool<CEntryExit> CEntryExitsPool;
namespace CEntryExitManager{
	CEntryExitsPool* *mp_poolEntryExits;
	int (*FindNearestEntryExit)(const CVector2D& position, float range, int ignoreArea);
	void _Init(){
		SET_TO(mp_poolEntryExits, SYM("_ZN17CEntryExitManager17mp_poolEntryExitsE"));
		SET_TO(FindNearestEntryExit, SYM("_ZN17CEntryExitManager20FindNearestEntryExitERK9CVector2Dfi"));
	}
}
namespace CFont{
	enum eFontStyle : uint8 {
		FONT_GOTHIC, FONT_SUBTITLES, FONT_MENU, FONT_PRICEDOWN
	};
